Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
of the data types into a pandas series. Create a separate list of index values for the
series.

In [1]:
import pandas as pd

In [2]:
l = list(range(1,11))

In [3]:
l

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [4]:
t = tuple(range(1,11))

In [5]:
t

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [6]:
s = set(range(1,11))

In [7]:
s

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [8]:
s = list(s)

In [9]:
s

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [10]:
series1 = pd.Series(l) # For converting the values into a series

In [11]:
series1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [12]:
series2 = pd.Series(t)

In [13]:
series2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [22]:
series2.index=['c','d','e','h','a','k','i','t','s','l']

In [23]:
series2

c     1
d     2
e     3
h     4
a     5
k     6
i     7
t     8
s     9
l    10
dtype: int64

In [14]:
series3 = pd.Series(s)
series3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [13]:
#set --> It is an unordered data type

In [15]:
! pip install ordered-set

Collecting ordered-set
  Using cached ordered_set-4.1.0-py3-none-any.whl (7.6 kB)
Installing collected packages: ordered-set
Successfully installed ordered-set-4.1.0

In [17]:
from ordered_set import OrderedSet

In [18]:
s = OrderedSet(range(1,11))
s

OrderedSet([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

In [19]:
series3 = pd.Series(s)

In [20]:
series3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [21]:
# Creating seperate index values --.
pd.Series(s, index=['a','b','c','d','e','f','g','h','i','j'])

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [30]:
series1.index=['k','l','m','n','o','p','q','r','s','t']

In [31]:
series1

k     1
l     2
m     3
n     4
o     5
p     6
q     7
r     8
s     9
t    10
dtype: int64

In [ ]:
# Dictionary --> key-value pairs,   key -- user-defined index value,  value-- the element/value that you want to store

2. Create a python dictionary with three key value pairs. Keep the keys as the first names,
and the respective last names as values in the dictionary. Use the dictionary to create a
pandas series.

In [24]:
a = {'Sachin':'Tendulkar', 'MS':'Dhoni', 'Virat':'Kohli'}

In [25]:
a

{'Sachin': 'Tendulkar', 'MS': 'Dhoni', 'Virat': 'Kohli'}

In [26]:
s1 = pd.Series(a)

In [27]:
s1

Sachin    Tendulkar
MS            Dhoni
Virat         Kohli
dtype: object

3. Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:

a. Convert it to a list.

b. Convert it to a dictionary.

c. Convert it to a tuple.

d. Convert it to a set.

In [28]:
sr = pd.Series(range(1,11))
sr

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [29]:
#a.
l = list(sr)

In [30]:
l

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [31]:
#b.
d = dict(sr)

In [32]:
d

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [33]:
#c.
t = tuple(sr)

In [34]:
t

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [35]:
#d.
s5 = set(sr)

In [36]:
s5

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [38]:
type(s5)

set

In [37]:
d1=dict(sr)
print(d)
type(d)

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

dict

4. Create a sample pandas series with x integer elements. Perform the following operations
on the same:

a. Print the first 5 elements of the series

b. Print the last 5 elements of the series

c. Insert an integer value ‘50’ at the index 5.

d. Update the last element in the series with the value 100.

e. Delete the first element from the series.

Note: The index values must not be affected by the operations and should be uniform for
the series after the last operation.

In [62]:
se = pd.Series(range(1,11))
se

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [45]:
#a.
se.head()   #head()---> first five elements present in your data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [46]:
#b.
se.tail()   #tail()---> last five elements

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [63]:
se1 = list(se)
se1.insert(5,50)

In [64]:
se1

[1, 2, 3, 4, 5, 50, 6, 7, 8, 9, 10]

In [65]:
se = pd.Series(se1)
se

0      1
1      2
2      3
3      4
4      5
5     50
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [42]:
se[5] = 50

In [43]:
se

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [59]:
se.add(50)

0    51
1    52
2    53
3    54
4    55
5    56
6    57
7    58
8    59
9    60
dtype: int64

In [61]:
se.iloc[5] = 50

In [62]:
se

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [48]:
se.update(pd.Series([50], index=[5]))

In [49]:
se

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [66]:
se[10] = 100

In [67]:
se

0       1
1       2
2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64

In [68]:
se

0       1
1       2
2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64

In [69]:
#e.
se = se.drop(0)

In [70]:
se

1       2
2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64

In [71]:
se = se.reset_index(drop=True)

In [75]:
se.tail(1)

9    100
dtype: int64

5. For a given pandas series obtained in the 4th step. Write a sample code to find the
element 100 in the series.

In [76]:
se

0      2
1      3
2      4
3      5
4     50
5      6
6      7
7      8
8      9
9    100
dtype: int64

In [78]:
for i in se:
    if i==100:
        print('100 is present')

100 is present

In [83]:
x = se[se==100]   # Checking the index value of element 100

In [84]:
x

9    100
dtype: int64

In [86]:
se[9]

100

6. For the given series A and B, perform concatenation on the same.

series_A = pd.Series([1,2,3,4,5])

series_B = pd.Series([6,7,8,9,10])

In [87]:
import pandas as pd

In [88]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])

In [89]:
c = pd.concat([series_A,series_B])

In [90]:
c

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [91]:
c = c.reset_index(drop=True)

In [92]:
c

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

7. Using loops in python, print all the elements within a pandas series.

Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [93]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

8. For a given nested list and a sample dictionary, create two data frames using pandas.

List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [94]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

In [96]:
df = pd.DataFrame(List) # For converting into a dataframe

In [97]:
df

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [98]:
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [99]:
df1 = pd.DataFrame(Dictionary)

In [100]:
df1

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following
operations on the same.

a. Print the first 3 rows of the Data Frame .

b. Print the rows that have the age greater than 15.

c. Insert 5 imaginary names and ages as values to the pandas Data Frame .

d. Update the 5th row so that the name = john and age=56.

e. Delete the first row from the Data Frame .

In [101]:
data = [['a',19],['b',18],['c',21],['d',15],['e',12]]

In [103]:
df2 = pd.DataFrame(data, columns = ['name','age'])

In [104]:
df2

  name  age
0    a   19
1    b   18
2    c   21
3    d   15
4    e   12

In [105]:
df2.head(3)

  name  age
0    a   19
1    b   18
2    c   21

In [108]:
(df2['name'][df2.age>15]) # The values in age column which are greater than 15

0    a
1    b
2    c
Name: name, dtype: object

In [109]:
df2.loc[5]=['f',20]

In [110]:
df2

  name  age
0    a   19
1    b   18
2    c   21
3    d   15
4    e   12
5    f   20

In [111]:
df2.loc[6] = ['g', 18]
df2.loc[7] = ['h', 12]
df2.loc[8] = ['i', 25]
df2.loc[9] = ['j', 22]

In [112]:
df2

  name  age
0    a   19
1    b   18
2    c   21
3    d   15
4    e   12
5    f   20
6    g   18
7    h   12
8    i   25
9    j   22

In [113]:
df2.loc[4] = ['john', 56]

In [114]:
df2

   name  age
0     a   19
1     b   18
2     c   21
3     d   15
4  john   56
5     f   20
6     g   18
7     h   12
8     i   25
9     j   22

In [115]:
df2 = df2.drop(0)

In [116]:
df2

   name  age
1     b   18
2     c   21
3     d   15
4  john   56
5     f   20
6     g   18
7     h   12
8     i   25
9     j   22

In [117]:
df2.reset_index(drop = True)

   name  age
0     b   18
1     c   21
2     d   15
3  john   56
4     f   20
5     g   18
6     h   12
7     i   25
8     j   22

10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary
respectively.

In [118]:
df2

   name  age
1     b   18
2     c   21
3     d   15
4  john   56
5     f   20
6     g   18
7     h   12
8     i   25
9     j   22

In [119]:
df2.values.tolist() # For converting a dataframe into a list

[['b', 18],
 ['c', 21],
 ['d', 15],
 ['john', 56],
 ['f', 20],
 ['g', 18],
 ['h', 12],
 ['i', 25],
 ['j', 22]]

In [120]:
dict(df2.values)

{'b': 18,
 'c': 21,
 'd': 15,
 'john': 56,
 'f': 20,
 'g': 18,
 'h': 12,
 'i': 25,
 'j': 22}

11. Create two separate Data Frame s A and B, and perform the following operations on
them.

a. Concatenate the two Data Frame s to a new Data Frame C.

b. Split the Data Frame C row wise.

c. Split the Data Frame column wise based on a condition. For example - columns
values greater than 10, column values less than 10, etc.

In [121]:
A = pd.DataFrame(range(1,21), columns = ['A'])

In [3]:
A

     A
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9   10
10  11
11  12
12  13
13  14
14  15
15  16
16  17
17  18
18  19
19  20

In [122]:
B = pd.DataFrame(range(20,0,-1), columns = ['B'])

In [123]:
B

     B
0   20
1   19
2   18
3   17
4   16
5   15
6   14
7   13
8   12
9   11
10  10
11   9
12   8
13   7
14   6
15   5
16   4
17   3
18   2
19   1

In [124]:
C = pd.concat([A,B], axis = 1)  #axis = 0-> rows, axis = 1 -> columns

In [7]:
C

     A   B
0    1  20
1    2  19
2    3  18
3    4  17
4    5  16
5    6  15
6    7  14
7    8  13
8    9  12
9   10  11
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1

In [125]:
split_c = C.iloc[0:10]  # fIRST 10 rows

In [126]:
split_c

    A   B
0   1  20
1   2  19
2   3  18
3   4  17
4   5  16
5   6  15
6   7  14
7   8  13
8   9  12
9  10  11

In [127]:
split_d = C.iloc[10:]   # [RowStartingIndexVAlue:RowEndingIndexVAlue+1, ColumnStartingIndexValue:ColumnEndingIndexValue+1]
                        #[:,:]

In [128]:
split_d

     A   B
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1

In [129]:
greater_10 = C['B']>10
g = C['A']>10

In [130]:
g

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
Name: A, dtype: bool

In [131]:
greater_10
d = C[greater_10]
e = C[g]

In [132]:
d

    A   B
0   1  20
1   2  19
2   3  18
3   4  17
4   5  16
5   6  15
6   7  14
7   8  13
8   9  12
9  10  11

In [133]:
e

     A   B
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1

In [134]:
pd.concat([d,e])

     A   B
0    1  20
1    2  19
2    3  18
3    4  17
4    5  16
5    6  15
6    7  14
7    8  13
8    9  12
9   10  11
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1

In [137]:
Q = C[(C['A']<10) & (C['B']>10)]

In [138]:
Q

   A   B
0  1  20
1  2  19
2  3  18
3  4  17
4  5  16
5  6  15
6  7  14
7  8  13
8  9  12

In [141]:
grouped = C.groupby(C.A)   # Referring to the A column, group all the values in A column
c_new = grouped.get_group(20)  # Extracting the row where the value is 20
c_new

     A  B
19  20  1

In [140]:
grouped

In [113]:
C.loc[(C.A > 10) & (C.B < 10), ['B']]

    B
11  9
12  8
13  7
14  6
15  5
16  4
17  3
18  2
19  1